docs/1c-export-mobile/MobileAgent/DataProcessors/Оплата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<DataProcessor>
		<Properties>
			<Name>Оплата</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МаршрутныйЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.МаршрутныйЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реализация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКОплате</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаUAH</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаUAH_Безнал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаUAHРек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаEUR</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаEURРек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаUSD</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаUSDРек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СдачаUAH</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СдачаUAHРек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СдачаEUR</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СдачаEURРек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СдачаUSD</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсUSD</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсEUR</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СдачаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СдачаUSDРек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоректировкаДолга</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыОплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КассовыйОрдер</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.КассовыйОрдер</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

docs/1c-export-mobile/MobileAgent/Enums/ВидДвиженияДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Enum>
		<Properties>
			<Name>ВидДвиженияДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

docs/1c-export-mobile/MobileAgent/DataProcessors/Оплата/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
перем СписокКлиєнтов;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("МаршрутныйЛист") Тогда
		Объект.МаршрутныйЛист 	= Параметры.МаршрутныйЛист;
	КонецЕсли;
	Если Параметры.Свойство("ЗаказПокупателя") Тогда
		Объект.ЗаказПокупателя 	= Параметры.ЗаказПокупателя;
	КонецЕсли;
	//Попытка
	Если Параметры.Свойство("Реализация") Тогда
		Объект.Реализация 	= Параметры.Реализация;
		Элементы.ВключитиСумуБоргу.Видимость = Истина;
	КонецЕсли;
	//Исключение
	//КонецПопытки;
	Если Параметры.Свойство("Контрагент") Тогда
		Объект.Контрагент 	= Параметры.Контрагент;
	КонецЕсли;
	Если Параметры.Свойство("СуммаКОплате") Тогда
		Объект.СуммаКОплате 	= Параметры.СуммаКОплате;
	КонецЕсли;
	
	Если Объект.СуммаКОплате = 0 Тогда 
		Объект.СуммаКОплате = Объект.Контрагент.Борг;
	КонецЕсли;
	

	Если Параметры.Свойство("ОтображатьКонтрагента") Тогда
		Элементы.Контрагент.Видимость = Параметры.ОтображатьКонтрагента;
		Элементы.Борги.Видимость = Параметры.ОтображатьКонтрагента;
	КонецЕсли;

	Объект.КурсEUR 			= Константы.КурсEUR.Получить();
	Объект.КурсUSD 			= Константы.КурсUSD.Получить();	
	Объект.ОплатаUAHРек		= Окр(Объект.СуммаКОплате * Объект.КурсEUR);
	Объект.ОплатаEURРек		= Объект.СуммаКОплате;
	Объект.ОплатаUSDРек		= Объект.СуммаКОплате * Объект.КурсEUR / Объект.КурсUSD;
	
	Объект.ОстатокДокумента	= Объект.СуммаКОплате;
	Элементы.ФормаДатьСкидкуНаОстаток.Доступность = Объект.ОстатокДокумента > 0 И Объект.ОстатокДокумента <= Константы.ПорогЗадолженостиEUR.Получить() 
													ИЛИ Объект.ОстатокДокумента < 0 И Объект.ОстатокДокумента >= -Константы.ПорогЗадолженостиEUR.Получить();
													
													
	Если Параметры.Свойство("МаршрутныйЛист") Или Параметры.Свойство("ЗаказПокупателя") Или Параметры.Свойство("Реализация") Тогда													
		Элементы.ВидДвиженияДенежныхСредств.Видимость  = Ложь;
	КонецЕсли;	
													
	Объект.ВидДвиженияДенежныхСредств = Перечисления.ВидДвиженияДенежныхСредств.Приход;																						
	Элементы.СтатьяДвиженияДенежныхСредств.Видимость = Ложь;
	Если ЗначениеЗаполнено(Объект.Реализация) Тогда
		Элементы.ВидДвиженияДенежныхСредств.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура СуммаПриИзмененииНаСервере()
	
	Объект.ОплатаДокумента 							= Объект.ОплатаEUR + Окр(Объект.ОплатаUAH / Объект.КурсEUR, 2) + Окр(Объект.ОплатаUAH_Безнал / Объект.КурсEUR, 2) + Окр(Объект.ОплатаUSD *  Объект.КурсUSD / Объект.КурсEUR, 2);	
	Объект.СдачаДокумента 							= Объект.СдачаEUR + Окр(Объект.СдачаUAH / Объект.КурсEUR, 2) + Окр(Объект.СдачаUSD *  Объект.КурсUSD / Объект.КурсEUR, 2);	
	Объект.ОстатокДокумента							= Объект.СуммаКОплате - Объект.ОплатаДокумента + Объект.СдачаДокумента;
	
	Объект.ОплатаUAHРек								= Окр(?((Объект.СуммаКОплате - Объект.ОплатаДокумента) < 0, 0, Окр((Объект.СуммаКОплате - Объект.ОплатаДокумента) * Объект.КурсEUR, 2)));
	Объект.ОплатаEURРек								= ?((Объект.СуммаКОплате - Объект.ОплатаДокумента) < 0, 0, (Объект.СуммаКОплате - Объект.ОплатаДокумента));
	Объект.ОплатаUSDРек								= ?((Объект.СуммаКОплате - Объект.ОплатаДокумента) < 0, 0, Окр((Объект.СуммаКОплате - Объект.ОплатаДокумента) * Объект.КурсEUR / Объект.КурсUSD, 2));
	
	Объект.СдачаUAHРек								= ?(Объект.ОстатокДокумента >= 0, 0, Объект.ОстатокДокумента * Объект.КурсEUR * (-1));
	Объект.СдачаEURРек								= ?(Объект.ОстатокДокумента >= 0, 0, Объект.ОстатокДокумента * (-1));
	Объект.СдачаUSDРек								= ?(Объект.ОстатокДокумента >= 0, 0, Окр(Объект.ОстатокДокумента * Объект.КурсEUR / Объект.КурсUSD * (-1), 2));
	
	Элементы.ФормаДатьСкидкуНаОстаток.Доступность 	= Объект.ОстатокДокумента > 0 И Объект.ОстатокДокумента <= Константы.ПорогЗадолженостиEUR.Получить() ИЛИ Объект.ОстатокДокумента < 0 И Объект.ОстатокДокумента >= -Константы.ПорогЗадолженостиEUR.Получить();
	
КонецПроцедуры

&НаКлиенте                                                                                                        		
Процедура СуммаПриИзменении(Элемент)
	Объект.КоректировкаДолга = 0;
	СуммаПриИзмененииНаСервере();	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	УстановкаКоректировкаДолга = ложь;
	Если Объект.ОплатаUAH + Объект.ОплатаUAH_Безнал + Объект.ОплатаEUR + Объект.ОплатаUSD Тогда 
		НовыйКассовыйОрдер 								= Документы.КассовыйОрдер.СоздатьДокумент();
		НовыйКассовыйОрдер.Дата 						= ТекущаяДата();
		//НовыйКассовыйОрдер.ВидДвиженияДенежныхСредств 	= Перечисления.ВидДвиженияДенежныхСредств.Приход;
		НовыйКассовыйОрдер.ВидДвиженияДенежныхСредств 	= Объект.ВидДвиженияДенежныхСредств;
		НовыйКассовыйОрдер.СтатьяДвиженияДенежныхСредств= Объект.СтатьяДвиженияДенежныхСредств;
		НовыйКассовыйОрдер.СуммаДокумента 				= Объект.ОплатаДокумента;
		НовыйКассовыйОрдер.СумаUAH 						= Объект.ОплатаUAH;
		НовыйКассовыйОрдер.СумаUAH_Безнал 				= Объект.ОплатаUAH_Безнал;
		НовыйКассовыйОрдер.БанковскийСчет				= Объект.БанковскийСчет;
		НовыйКассовыйОрдер.СумаEUR 						= Объект.ОплатаEUR;
		НовыйКассовыйОрдер.СумаUSD 						= Объект.ОплатаUSD;
		НовыйКассовыйОрдер.Основание 					= Объект.Реализация;
		НовыйКассовыйОрдер.Контрагент 					= Объект.Контрагент;
		НовыйКассовыйОрдер.КурсEUR 						= Объект.КурсEUR;
		НовыйКассовыйОрдер.КурсUSD 						= Объект.КурсUSD;
		НовыйКассовыйОрдер.МаршрутныйЛист 				= Объект.МаршрутныйЛист;
		НовыйКассовыйОрдер.ЗаказПокупателя 				= Объект.ЗаказПокупателя;
		НовыйКассовыйОрдер.КоректировкаДолга			= Объект.КоректировкаДолга;
		НовыйКассовыйОрдер.УИДКоректировки				= Новый УникальныйИдентификатор;
		УстановкаКоректировкаДолга = Истина;
		Попытка
			НовыйКассовыйОрдер.Записать(РежимЗаписиДокумента.Проведение);
			НоваяСтрока = Объект.ДокументыОплаты.Добавить();
			НоваяСтрока.КассовыйОрдер = НовыйКассовыйОрдер.Ссылка;
		Исключение
			НовыйКассовыйОрдер.Записать(РежимЗаписиДокумента.Запись);
			НоваяСтрока = Объект.ДокументыОплаты.Добавить();
			НоваяСтрока.КассовыйОрдер = НовыйКассовыйОрдер.Ссылка;
		КонецПопытки;	
		ПКО = НовыйКассовыйОрдер.Ссылка;
	КонецЕсли;
	Если Объект.СдачаEUR + Объект.СдачаUAH + Объект.СдачаUSD Тогда 
	   	НовыйКассовыйОрдер 								= Документы.КассовыйОрдер.СоздатьДокумент();
		НовыйКассовыйОрдер.Дата 						= ТекущаяДата();
		НовыйКассовыйОрдер.ВидДвиженияДенежныхСредств 	= Перечисления.ВидДвиженияДенежныхСредств.Расход;
	   	НовыйКассовыйОрдер.СуммаДокумента 				= Объект.СдачаДокумента;
	   	НовыйКассовыйОрдер.СумаUAH 						= Объект.СдачаUAH;
	   	НовыйКассовыйОрдер.СумаEUR 						= Объект.СдачаEUR;
	   	НовыйКассовыйОрдер.СумаUSD 						= Объект.СдачаUSD;
	   	НовыйКассовыйОрдер.Основание 					= Объект.Реализация;
	   	НовыйКассовыйОрдер.Контрагент 					= Объект.Контрагент;
	   	НовыйКассовыйОрдер.КурсEUR 						= Объект.КурсEUR;
	  	НовыйКассовыйОрдер.КурсUSD 						= Объект.КурсUSD;
	   	НовыйКассовыйОрдер.МаршрутныйЛист 				= Объект.МаршрутныйЛист;
	   	НовыйКассовыйОрдер.ЗаказПокупателя 				= Объект.ЗаказПокупателя;
		НовыйКассовыйОрдер.СдачаДокумента				= ПКО;
		Если НЕ УстановкаКоректировкаДолга Тогда 
			НовыйКассовыйОрдер.КоректировкаДолга			= Объект.КоректировкаДолга;
			НовыйКассовыйОрдер.УИДКоректировки				= Новый УникальныйИдентификатор;
		КонецЕсли;
		
		Попытка
	   		НовыйКассовыйОрдер.Записать(РежимЗаписиДокумента.Проведение);
			НоваяСтрока = Объект.ДокументыОплаты.Добавить();
			НоваяСтрока.КассовыйОрдер = НовыйКассовыйОрдер.Ссылка;
		Исключение
			НовыйКассовыйОрдер.Записать(РежимЗаписиДокумента.Запись);
			НоваяСтрока = Объект.ДокументыОплаты.Добавить();
			НоваяСтрока.КассовыйОрдер = НовыйКассовыйОрдер.Ссылка;
		КонецПопытки;			
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьНаСервере();
	Закрыть(ПолучитьМассивДокументовОплаты());
	
КонецПроцедуры

&НаСервере
Процедура ДатьСкидкуНаОстатокНаСервере()

	ДокументРеализации 	= Объект.Реализация.ПолучитьОбъект();
	СуммаМаксимум 		= 0;
	СтрокаМаксимум 		= Неопределено;
	Для Каждого СтрТовар Из ДокументРеализации.Товары Цикл 
		Если СтрТовар.Сума > СуммаМаксимум Тогда 
			СтрокаМаксимум 		= СтрТовар;
		КонецЕсли;	
	КонецЦикла;
	Если СтрокаМаксимум <> Неопределено Тогда 
		Если Объект.ОстатокДокумента > 0 И Объект.ОстатокДокумента <= Константы.ПорогЗадолженостиEUR.Получить() ИЛИ Объект.ОстатокДокумента < 0 И Объект.ОстатокДокумента >= -Константы.ПорогЗадолженостиEUR.Получить() Тогда 
			СтрокаМаксимум.Сума 	= СтрокаМаксимум.Сума - Объект.ОстатокДокумента;
			СтрокаМаксимум.Цена 	= ?(СтрокаМаксимум.Количество = 0, 0, СтрокаМаксимум.Сума / СтрокаМаксимум.Количество);
			СтрокаМаксимум.Знижка = Истина;
			ДокументРеализации.Записать(РежимЗаписиДокумента.Проведение);
			ВключитиСумуБоргуПриИзмененииНаСервере();//Объект.СуммаКОплате 	= ДокументРеализации.Товары.Итог("Сума");
			СуммаПриИзмененииНаСервере();
		КонецЕсли;	
	КонецЕсли;		
	
КонецПроцедуры


&НаКлиенте
Процедура ДатьСкидкуНаОстаток(Команда)
	
	Если Объект.Реализация.Пустая() Тогда 
		Объект.СуммаКОплате = Объект.СуммаКОплате - Объект.ОстатокДокумента;
		Объект.КоректировкаДолга = Объект.ОстатокДокумента;
		СуммаПриИзмененииНаСервере()
	Иначе
		ДатьСкидкуНаОстатокНаСервере();
	КонецЕсли;
	
	Попытка
		ВладелецФормы.Родитель.ТекущиеДанные.Сумма = ВладелецФормы.Родитель.ТекущиеДанные.Сумма - Объект.ОстатокДокумента;
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивДокументовОплаты()
	
	Возврат Объект.ДокументыОплаты.Выгрузить().ВыгрузитьКолонку("КассовыйОрдер");
	
КонецФункции	

&НаКлиенте
Процедура КурсПриИзменении(Элемент)
	
	Объект.ОплатаUAHРек		= окр(Объект.СуммаКОплате * Объект.КурсEUR);
	Объект.ОплатаEURРек		= Объект.СуммаКОплате;
	Объект.ОплатаUSDРек		= Объект.СуммаКОплате * Объект.КурсEUR / Объект.КурсUSD;	
	Объект.ОстатокДокумента	= Объект.СуммаКОплате;
	
КонецПроцедуры


&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	Объект.СуммаКОплате = Объект.Контрагент.Борг;

КонецПроцедуры


&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Клієнтський.ИнфоБорг(Объект,  Элементы.Борги);
	КонтрагентПриИзмененииНаСервере();
	СуммаПриИзмененииНаСервере();

КонецПроцедуры


&НаСервере
Процедура ВключитиСумуБоргуПриИзмененииНаСервере()
	мБорг = ?(ВключитиСумуБоргу, Объект.Контрагент.борг, 0);
	СуммаОплаченно = 0;
	
	Если не Объект.МаршрутныйЛист.Пустая() Тогда 
		мОплаты = Объект.МаршрутныйЛист.Оплаты.Выгрузить();
		Оплаченно = мОплаты.НайтиСтроки(Новый Структура("Реализация", объект.Реализация));
		Для Каждого Элемент Из Оплаченно Цикл 
			СуммаОплаченно = СуммаОплаченно + Элемент.Сумма;	
		КонецЦикла;				
	КонецЕсли;
	
	мСуммаКОплате = ?(объект.Реализация.Пустая(), 0, Объект.Реализация.Сума);
	
	Объект.СуммаКОплате = мБорг + мСуммаКОплате - СуммаОплаченно;
	
	СуммаПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ВключитиСумуБоргуПриИзменении(Элемент)
	Объект.КоректировкаДолга = 0;
	ВключитиСумуБоргуПриИзмененииНаСервере();	
КонецПроцедуры




&НаСервере
Функция ПолучитьКонтрагентаПоЗначению()
	СЗ = Новый СписокЗначений;	
	Элементы.Контрагент.СписокВыбора.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка,
		|	Контрагенты.Город КАК Город,
		|	Контрагенты.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты";
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СЗ.Добавить(ВыборкаДетальныеЗаписи.Ссылка, ВыборкаДетальныеЗаписи.Наименование + " (" + ВыборкаДетальныеЗаписи.Город + ")");

	КонецЦикла;
	
	Возврат СЗ;
КонецФункции

&НаКлиенте
Процедура КонтрагентАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	//КонтрагентАвтоПодборНаСервере(Текст, ДанныеВыбора);
	
	//ПараметрыПолученияДанных.СпособПоискаСтроки =  СпособПоискаСтрокиПриВводеПоСтроке.ЛюбаяЧасть;
	//ПараметрыПолученияДанных.ПолнотекстовыйПоиск = ПолнотекстовыйПоискПриВводеПоСтроке.Использовать;
	ДанныеВыбора = Новый СписокЗначений;
	Для Каждого Элемент Из СписокКлиєнтов Цикл 
		Если СтрНайти(НРег(Элемент.Значение), НРег(Текст)) Тогда 
			ДанныеВыбора.Добавить(Элемент.Значение, Элемент.Представление);
		КонецЕсли;
		
	КонецЦикла;
	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.ОплатаUAH_Безнал > 0 Тогда
		Элементы.ГруппаБанковскийСчет.Видимость = Истина;
		//Элементы.ОтправитьВайбер.Видимость = Истина;
	Иначе
		Элементы.ГруппаБанковскийСчет.Видимость = Ложь;
		//Элементы.ОтправитьВайбер.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Функция ПолучитьСписокОтбора(ПоКонтагенту = Ложь, ОтображатьЗапрещенныеСчета = Ложь)
	СписокОтбора = Новый СписокЗначений;
	Если ПоКонтагенту Тогда
		Для Каждого стрБанковскийСчет Из Объект.Контрагент.БанковскиеСчета Цикл
			Если стрБанковскийСчет.БанковскийСчет.НеВідображатиВДодатку Тогда
				Продолжить;
			КонецЕсли;	
			СписокОтбора.Добавить(стрБанковскийСчет.БанковскийСчет);			
		КонецЦикла;	
	Иначе
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БанковскиеСчета.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.БанковскиеСчета КАК БанковскиеСчета
		|ГДЕ
		|	(БанковскиеСчета.НеВідображатиВДодатку = ЛОЖЬ
		|			ИЛИ &ОтображатьЗапрещенныеСчета)";
	Запрос.УстановитьПараметр("ОтображатьЗапрещенныеСчета", ОтображатьЗапрещенныеСчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокОтбора.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
		
	КонецЕсли;	
	
	Возврат СписокОтбора;
КонецФункции	



&НаКлиенте
Процедура БанковскийСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	
	СтандартнаяОбработка = Ложь;
	
	фиксНастройки = Новый НастройкиКомпоновкиДанных;
	
	эОтбор = фиксНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	эОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	эОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	
	Если Не ОтображатьВсеСчета Тогда
		СписокОтбора = ПолучитьСписокОтбора(Истина, Объект.ВидДвиженияДенежныхСредств = ПолучитьПеречислениеВидДвиженияДенежныхСредствРасход()); 	
	Иначе	
		СписокОтбора = ПолучитьСписокОтбора(Ложь, Объект.ВидДвиженияДенежныхСредств = ПолучитьПеречислениеВидДвиженияДенежныхСредствРасход()); 	
	КонецЕсли;	
	
	эОтбор.ПравоеЗначение = СписокОтбора;
	эОтбор.Использование = Истина;	
	
	эОтбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФиксированныеНастройки", фиксНастройки);   
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораСчета", ЭтаФорма,"Подбор");
	
	ОткрытьФорму("Справочник.БанковскиеСчета.ФормаВыбора",ПараметрыФормы,
	ЭтаФорма, , , , ОбработкаВыбора);	
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПеречислениеВидДвиженияДенежныхСредствРасход() Экспорт
	Возврат Перечисления.ВидДвиженияДенежныхСредств.Расход;
КонецФункции


&НаКлиенте
Процедура ПриЗакрытииФормыВыбораСчета(Значение, ДопПараметры) Экспорт
    Если Значение = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
		Объект.БанковскийСчет = Значение;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьОписаниеСчета(БанковскийСчет)
	Возврат БанковскийСчет.Опис;
КонецФункции	

&НаСервере
Функция ПолучитьТекстДляВайбер()
	ТекстСообщения = "";	
	Если Объект.ВидДвиженияДенежныхСредств = Перечисления.ВидДвиженияДенежныхСредств.Приход Тогда
		ТекстСообщения =  "Реквізити оплати : " + Символы.ПС +  Символы.ПС + Строка(ПолучитьОписаниеСчета(Объект.БанковскийСчет)) + Символы.ПС + Символы.ПС  + "Сума : " + Строка(Объект.ОплатаUAH_Безнал) + "грн ";
	ИначеЕсли Объект.ВидДвиженияДенежныхСредств = Перечисления.ВидДвиженияДенежныхСредств.Расход Тогда	
		ТекстСообщения =  "Оплата на витрати : " + Символы.ПС +  Символы.ПС + Строка(Объект.СтатьяДвиженияДенежныхСредств) + Символы.ПС + Символы.ПС  + "Сума : ";
		Если Объект.ОплатаUAH_Безнал > 0 Тогда 
			ТекстСообщения = ТекстСообщения + Символы.ПС + Формат(Объект.ОплатаUAH_Безнал, "ЧДЦ=2") + " грн безгот.";
			ТекстСообщения = ТекстСообщения + Символы.ПС + Строка(Объект.БанковскийСчет); 
			ТекстСообщения = ТекстСообщения + Символы.ПС;
		КонецЕсли;
		Если Объект.ОплатаUAH > 0 Тогда 
			ТекстСообщения = ТекстСообщения + Символы.ПС + Формат(Объект.ОплатаUAH, "ЧДЦ=2") + " грн";
		КонецЕсли;     
		Если Объект.ОплатаEUR > 0 Тогда 
			ТекстСообщения = ТекстСообщения + Символы.ПС + Формат(Объект.ОплатаEUR, "ЧДЦ=2") + " EUR";
		КонецЕсли; 
		Если Объект.ОплатаUSD > 0 Тогда 
			ТекстСообщения = ТекстСообщения + Символы.ПС + Формат(Объект.ОплатаUSD, "ЧДЦ=2") + " USD";
		КонецЕсли;		
	КонецЕсли;	
		
	Возврат ТекстСообщения;	
КонецФункции	

&НаКлиенте
Процедура ОтправитьВайбер(Команда)
	
	//ТекстСообщения =  "Реквізити оплати : " + Символы.ПС +  Символы.ПС + Строка(ПолучитьОписаниеСчета(Объект.БанковскийСчет)) + Символы.ПС + Символы.ПС  + "Сума : " + Строка(Объект.ОплатаUAH_Безнал) + "грн ";
	ТекстСообщения = ПолучитьТекстДляВайбер();
	
	#Если МобильноеПриложениеКлиент Тогда
		
		НовВз = Новый ЗапускПриложенияМобильногоУстройства();
		
		НовВз.Действие = "android.intent.action.SEND";
		НовВз.Приложение = "com.viber.voip"; 
		НовВз.ИмяКласса = "com.viber.voip.WelcomeShareActivity"; 
		НовВз.Тип = "text/plain";
		НовВз.ДополнительныеДанные.Добавить("android.intent.extra.TEXT", СокрЛП(ТекстСообщения));
		
		НовВз.Запустить(Истина);
	#Иначе 
		Сообщить(ТекстСообщения);
	#КонецЕсли
КонецПроцедуры

&НаСервере
Процедура ВидДвиженияДенежныхСредствПриИзмененииНаСервере()
	Если Объект.ВидДвиженияДенежныхСредств = Перечисления.ВидДвиженияДенежныхСредств.Приход Тогда
		Элементы.СтатьяДвиженияДенежныхСредств.Видимость = Ложь;
		Элементы.Контрагент.Видимость = Истина;
		Элементы.СдачаUAH.Видимость = Истина;
		Элементы.ГруппаСдачаUAH.Видимость = Истина;
		Элементы.ГруппаСдачаEUR.Видимость = Истина;
		Элементы.ГруппаСдачаUSD.Видимость = Истина;
		Элементы.СуммаКОплате.Видимость = Истина;
		Элементы.Борги.Видимость = Истина;		
	Иначе	
		Элементы.СтатьяДвиженияДенежныхСредств.Видимость = Истина;
		Элементы.Контрагент.Видимость = Ложь; 
		Элементы.ГруппаСдачаUAH.Видимость = Ложь;
		Элементы.ГруппаСдачаEUR.Видимость = Ложь;
		Элементы.ГруппаСдачаUSD.Видимость = Ложь; 
		Элементы.СуммаКОплате.Видимость = Ложь; 
		Элементы.Борги.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВидДвиженияДенежныхСредствПриИзменении(Элемент)
	ВидДвиженияДенежныхСредствПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОплатаUAH1ПриИзмененииНаСервере()
	Объект.КоректировкаДолга = 0;
	СуммаПриИзмененииНаСервере();

	Если Объект.ОплатаUAH_Безнал > 0 Тогда
		Элементы.ГруппаБанковскийСчет.Видимость = Истина;
		//Элементы.ОтправитьВайбер.Видимость = Истина;
		Если Объект.ВидДвиженияДенежныхСредств = Перечисления.ВидДвиженияДенежныхСредств.Расход Тогда
			ОтображатьВсеСчета = Истина;
		КонецЕсли;	
	Иначе
		Элементы.ГруппаБанковскийСчет.Видимость = Ложь;
		//Элементы.ОтправитьВайбер.Видимость = Ложь; 
		ОтображатьВсеСчета = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОплатаUAH1ПриИзменении(Элемент)
	ОплатаUAH1ПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура БанковскийСчетПриИзмененииНаСервере()
	Если Объект.БанковскийСчет.НеВідображатиВДодатку И Объект.ВидДвиженияДенежныхСредств = Перечисления.ВидДвиженияДенежныхСредств.Приход Тогда                  		 
		 Сообщить(Строка(Объект.БанковскийСчет) + " не можна вибирати при приході ! ");
		 Объект.БанковскийСчет = Справочники.БанковскиеСчета.ПустаяСсылка();
	КонецЕсли;	 
КонецПроцедуры

&НаКлиенте
Процедура БанковскийСчетПриИзменении(Элемент)
	БанковскийСчетПриИзмененииНаСервере();
КонецПроцедуры



СписокКлиєнтов = ПолучитьКонтрагентаПоЗначению()
